#include "commom.h"
#include "drawFace.h"
#include "drawSysSet.h"


void updateInfoData()
{
	
}






structMenu mainMenu[] = 
{
	//ä¸‹æ ‡ä»x = 1, y = 8 å¼€å§‹   å³è¾¹å¯¹å…¶xæ˜¯140
	{3,"1.µØ¿é²âÁ¿",0,0,1,7,0},
	{4,"2.×öÆ½Ãæ",0,0,2,9,0},
	{5,"3.×öĞ±Ãæ",0,0,2,11,0},
	{10,"4.ÎÀĞÇĞÅºÅ",0,0,140,7,0},
	{6,"5.²âÁ¿Êı¾İ",0,0,140,9,0},
	{2,"6.ÏµÍ³ÉèÖÃ",0,0,140,11,0},
};

structMenu sysSet[] = 
{
	//ä¸‹æ ‡ä»x = 1, y = 8 å¼€å§‹   å³è¾¹å¯¹å…¶xæ˜¯140
	{11,"1.¶ÈÁ¿µ¥Î»",0,0,2,7,0},
	{12,"2.µçÌ¨ÆµµÀ",0,0,2,9,0},
	{13,"3.²ù¶·¿í¶È",0,0,2,11,0},
	{14,"4.ÌìÏßÎ»ÖÃ",0,0,2,13,0},
	{15,"5.Éı½µĞ£×¼",0,0,2,15,0},
	{16,"6.Ê±¼äÉèÖÃ",0,0,140,7,0},
	{17,"7.ÓïÑÔÑ¡Ôñ",0,0,140,9,0},
	{18,"8.Çå¿ÕÄÚ´æ",0,0,140,11,0},
	{19,"9.ÓĞ¹Ø±¾»ú",0,0,140,13,0},
};
//µØ¿é²âÁ¿
structMenu parcelSurvey[] = 
{
	{1,"Ãæ»ı:%c%.3lfÄ¶",0,0,2,7,0},
	{2,"×î¸ß:%c%.3lfÃ×",0,0,2,9,0},
	{3,"Æ½¾ù:%c%.3lfÃ×",0,0,2,11,0},
	{4,"µ±Ç°:%c%.3lfÃ×",0,0,2,13,0},
	{5,"ÖÜ³¤:%c%.3lfÃ×",0,0,140,7,0},
	{6,"×îµÍ:%c%.3lfÃ×",0,0,140,9,0},
	{7,"ÍÁ·½:%c%.3lf·½",0,0,140,11,0},
	{8,"¾àÀë:%c%.3lfÃ×",0,0,140,13,0},
};
//×öÆ½Ãæ
structMenu planeMenu[] = 
{
	{1,"±ê¸ß:%c%.3lfÃ×",0,0,60,7,0},
	{2,"µ±Ç°:%c%.3lfÃ×",0,0,60,9,0},
	{3,"¸ß²î:%c%.3lfÃ×",0,0,60,11,0},
	{4,"¶¯×÷:ÍÚ",       0,0,60,13,0},
	{5,"¾àÀëÆğµã:%.3lfÃ×",0,0,60,15,0},
	{6,"Ç°½ø·½Ïò:%d ¶«ÄÏ",0,0,60,17,0},
	{7,"ĞĞÊ»ËÙ¶È:%0lffKm/h",0,0,60,19,0},
};
//×öĞ±Ãæ
structMenu xieMenu[] = 
{
	{1,"±ê¸ß:%c%.3lfÃ×",0,0,60,7,0},
	{2,"µ±Ç°:%c%.3lfÃ×",0,0,60,9,0},
	{3,"¸ß²î:%c%.3lfÃ×",0,0,60,11,0},
	{4,"¶¯×÷:ÍÚ",       0,0,60,13,0},
	{5,"¾àÀëÆğµã:%.3lfÃ×",0,0,60,15,0},
	{6,"Ç°½ø·½Ïò:%d ¶«ÄÏ",0,0,60,17,0},
	{7,"ĞĞÊ»ËÙ¶È:%01ffKm/h",0,0,60,19,0},
};
//²âÁ¿Êı¾İ
structMenu meauseData[] = 
{
	{1,"±àºÅ:%03d",0,0,2,4,0},
	{2,"Ãæ»ı:%dÄ¶",0,0,2,6,0},
	{3,"ÖÜ³¤:%dÄ¶",0,0,2,8,0},
	{4,"¶¨¸ß:%.2dÄ¶",0,0,2,10,0},
	{5,"Ê±¼ä:",0,0,90,4,0},//%d-%02d-%02d %02d:%02d
	{6,"ÍÁ·½¼ÆËã:%.0lf·½",0,0,106,6,0},
	{7,"Æğµã¾àÀë:%.0lfÃ×",0,0,106,8,0},	
	{8,"¸ß/µÍ:",0,0,106,10,0},//%.2lf/%.2lf"
};

struct list_pro list[22] = {0};
structFaceInfo g_arrayface[] = 
{
	//id   ishead   title  list     func   facemenu          void *data
	
	{1 , 1 , "±ùºÓµ¼º½Æ½µØ»ú" ,  &list[1]  ,  draw_main_face ,  mainMenu  ,6 ,  NULL} ,   //1
	{2 , 1 , "ÏµÍ³ÉèÖÃ" ,       &list[2]  ,  draw_sysSet_face  ,  sysSet  , 9 , NULL} , //2
	{3 , 1 , "µØ¿é²âÁ¿" ,       &list[3]  ,  draw_parcelSurvey_face  ,  parcelSurvey  ,8 , NULL} , //3
	{4 , 1 , "×öÆ½Ãæ" ,         &list[4] , draw_planeMenu_face , planeMenu ,  7, NULL} , //4
	{5 , 1 , "×öĞ±Ãæ" ,         &list[5] , draw_xieMenu_face , xieMenu , 7,NULL} , //5
	{6 , 0 , "²âÁ¿Êı¾İ" ,       &list[6] , draw_meauseData_face , meauseData , 8 , NULL} , //6
	{7 , 1 , "ÉèÖÃÆ½Ãæ¸ß¶È" ,   &list[7] , draw_setPlaneHigh_face , NULL ,0 ,  NULL} , //7
	{8 , 1 , "ÉèÖÃĞ±ÃæÆğµã" ,   &list[8] , draw_setXieHigh_face , NULL ,0 , NULL} , //8
	{9 , 1 , "ÉèÖÃĞ±ÃæÖÕµã" ,   &list[9] , draw_setEndXieHigh_face , NULL , 0 ,NULL} , //9
	{10 , 1 , "ÎÀĞÇĞÅºÅ" ,      &list[10] , draw_setStat_face , NULL , 0 ,NULL} , //10
	{11 , 1 , "¶ÈÁ¿µ¥Î»" ,      &list[11] , draw_unitmeasure_face , NULL ,0 , NULL} , //11
	{12 , 1 , "µçÌ¨ÆµµÀ" ,      &list[12] , draw_boardchannel_face , NULL ,0 , NULL} , //12
	{13 , 1 , "²ù¶·¿í¶È" ,      &list[13] , draw_bucketwidght_face , NULL ,0 , NULL} , //13
	{14 , 1 , "ÌìÏßÎ»ÖÃ" ,      &list[14] , draw_antlocal_face , NULL ,0 , NULL} , //14
	{15 , 1 , "Éı½µĞ£×¼" ,      &list[15] , draw_roisedownadj_face , NULL ,0 , NULL} , //15
	{16 , 1 , "Ê±¼äÉèÖÃ" ,      &list[16] , draw_timeset_face , NULL ,0 , NULL} , //16
	{17 , 1 , "ÓïÑÔÑ¡Ôñ" ,      &list[17] , draw_langselect_face , NULL ,0 , NULL} , //17
	{18 , 1 , "Çå¿ÕÄÚ´æ" ,      &list[18] , draw_cleanmem_face , NULL ,0 , NULL} , //18
	{19 , 1 , "ÓĞ¹Ø±¾»ú" ,      &list[19] , draw_about_face , NULL ,0 , NULL} , //19
};




